app/controllers/records_controller.rb

SELECT  `records`.* FROM `records`  ORDER BY id DESC LIMIT 7 OFFSET 0
SELECT COUNT(*) FROM `records`
---
  def index
    @records = Record.order("id DESC").limit(7).page(params[:page])

INSERT INTO `records` (`date`, `created_at`, `updated_at`) VALUES ('2015-09-13 07:13:35', '2015-09-13 07:13:35', '2015-09-13 07:13:35')
---
  def new
  	# @record = Record.new
    #  @memo = @record.build_memo
    # redirect_to action: 'create'
    @record = Record.create(date: Time.now)